:PROPERTIES:
:ID:       8e388c1a-5f24-49f1-a121-d533d1a50d11
:header-args:sh: :prologue "exec 2>&1" :epilogue ":"
:END:
#+title: Tullia


* runtimes
** unwrapped

#+begin_src sh :async :exports both :results output
 tullia run julia-cli --runtime unwrapped --log-level debug
#+end_src

#+RESULTS:
: [90m11:02PM[0m [33mDBG[0m parsed args [36mconfig=[0m{"DagFlake":".#tullia.x86_64-linux.dag","Mode":"cli","Runtime":"unwrapped","Task":"julia-cli","TaskFlake":".#tullia.x86_64-linux.task"}
: path '/home/gtrun/ghq/github.com/GTrunSec/DeSci/docs/org' does not contain a 'flake.nix', searching up
: warning: Git tree '/home/gtrun/ghq/github.com/GTrunSec/DeSci' is dirty
: [90m11:02PM[0m [1m[31mFTL[0m[0m starting CLI [36merror=[0m[31m"open /dev/tty: no such device or address"[0m

** Podman

#+begin_src sh :async :exports both :results raw
 tullia run julia-cli --runtime podman --log-level debug
#+end_src

#+RESULTS:
[90m11:02PM[0m [33mDBG[0m parsed args [36mconfig=[0m{"DagFlake":".#tullia.x86_64-linux.dag","Mode":"cli","Runtime":"podman","Task":"julia-cli","TaskFlake":".#tullia.x86_64-linux.task"}
path '/home/gtrun/ghq/github.com/GTrunSec/DeSci/docs/org' does not contain a 'flake.nix', searching up
warning: Git tree '/home/gtrun/ghq/github.com/GTrunSec/DeSci' is dirty
[90m11:02PM[0m [1m[31mFTL[0m[0m starting CLI [36merror=[0m[31m"open /dev/tty: no such device or address"[0m

** nsjail

#+begin_src sh :async :exports both :results output
sudo chown $USER:users /sys/fs/cgroup/user.slice/user-1000.slice/cgroup.procs
#+end_src


#+begin_src sh :async :exports both :results sh
faketty tullia run julia-cli --runtime nsjail --log-level warn
#+end_src

#+RESULTS:
| path                    | '/home/gtrun/ghq/github.com/GTrunSec/DeSci/docs/org' | does | not  | contain | a | 'flake.nix', | searching | up |
| warning:                    | Git  | tree | '/home/gtrun/ghq/github.com/GTrunSec/DeSci' | is | dirty |   |   |   |
| [?25l[+]                    | build  | julia-cli | 0.0s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.1s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.2s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.3s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.4s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.5s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.6s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.7s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.8s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 0.9s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.0s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.1s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.2s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.3s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.4s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.5s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.6s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.7s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.8s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 1.9s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.0s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.1s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.2s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.3s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.4s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.5s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.6s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.7s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.8s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 2.9s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 3.0s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 3.1s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 3.2s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | build  | julia-cli | 3.3s  |  |   |   |   |   |
| [80D[1A[80D[2K[+]                    | run  | julia-cli | 3.3s  |  |   |   |   |   |
| [80D[2K[1A[80D[2K[+]                    | run  | julia-cli | 3.4s  |  |   |   |   |   |
| +                    | cli  | df | x  |  |   |   |   |   |
| [80D[2K[1A[2K[1A[80D[2K[+]                    | run  | julia-cli | 3.5s  |  |   |   |   |   |
| +                    | cli  | df | x  |  |   |   |   |   |
| Activating                    | project  | at | `/nix/store/3cd027nlmai39pjay8b2hl8ximk1896z-cli` |  |   |   |   |   |
| [80D[1A[1A[1A[80D[2K[+]                    | run  | julia-cli | 3.6s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 3.7s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 3.8s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 3.9s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 4.0s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 4.1s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 4.2s  |  |   |   |   |   |
| [1B[1B[80D[1A[1A[1A[80D[2K[+]                   | run  | julia-cli | 4.3s  |  |   |   |   |   |
| [1B[1B[80D[2K[1A[2K[1A[2K[1A[80D[2K[+]                   | run  | julia-cli | 4.3s  |  |   |   |   |   |
| +                    | cli  | df | x  |  |   |   |   |   |
| Activating                    | project  | at | `/nix/store/3cd027nlmai39pjay8b2hl8ximk1896z-cli` |  |   |   |   |   |
| 3×1                    | DataFrame  |  |    |   |   |   |   |   |
| Row                    | │  | x |   |   |   |   |   |   |
| │                    | Int64  |  |    |   |   |   |   |   |
| ─────┼───────                    |   |   |    |   |   |   |   |   |
| 1                    | │  | 1 |   |   |   |   |   |   |
| 2                    | │  | 2 |   |   |   |   |   |   |
| 3                    | │  | 3 |   |   |   |   |   |   |
| [80D[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[2K[1A[80D[2K[✔] | done  | julia-cli | 4.301026348s  |  |   |   |   |   |
| [80D[2K[?1002l[?1003l[?25h                    |    |   |    |   |   |   |   |   |


* Dag Jobs

#+begin_src sh :async :exports both :results output
tullia run ci --runtime nsjail --log-level debug
#+end_src

#+RESULTS:
: [90m11:05PM[0m [33mDBG[0m parsed args [36mconfig=[0m{"DagFlake":".#tullia.x86_64-linux.dag","Mode":"cli","Runtime":"nsjail","Task":"ci","TaskFlake":".#tullia.x86_64-linux.task"}
: path '/home/gtrun/ghq/github.com/GTrunSec/DeSci/docs/org' does not contain a 'flake.nix', searching up
: warning: Git tree '/home/gtrun/ghq/github.com/GTrunSec/DeSci' is dirty
: [90m11:05PM[0m [1m[31mFTL[0m[0m starting CLI [36merror=[0m[31m"open /dev/tty: no such device or address"[0m
